atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/i2c_resource.c
/*
 * This file is part of AtomVM.
 *
 * Copyright 2019 Davide Bettio <davide@uninstall.it>
 * Copyright 2023 Fred Dushin <fred@dushin.net>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#include <sdkconfig.h>

#include <string.h>

// Note: The i2c.h legacy driver will be deprecated in 5.2
// TODO: Migrate to i2c_master.h, once we drop support for IDF SDK 4.x
#include <driver/i2c.h>
#include <esp_log.h>

#include <context.h>
#include <defaultatoms.h>
#include <erl_nif_priv.h>
#include <globalcontext.h>
#include <interop.h>
#include <module.h>
#include <nifs.h>
#include <term.h>

// #define ENABLE_TRACE
#include <trace.h>

#include <esp32_sys.h>
#include <sys.h>

#define TAG "i2c_resource"

#define CHECK_ERROR(ctx, err, msg)                                                      \
if (UNLIKELY(err != ESP_OK)) {                                                          \
    ESP_LOGE(TAG, msg ": err: %i.", err);                                               \
    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {             \
        return OUT_OF_MEMORY_ATOM;                                                      \
    }                                                                                   \
    return create_error_tuple(ctx, esp_err_to_term(ctx->global, err));                  \
}

#define ACK_ENABLE true
#define MS_TO_TICKS(MS) (MS / portTICK_PERIOD_MS)
#define DEFAULT_SEND_TIMEOUT_MS 500

#define EINPROGRESS_ATOMSTR (ATOM_STR("\xB", "einprogress"))
#define I2C_ATOMSTR (ATOM_STR("\x4", "$i2c"))

static ErlNifResourceType *i2c_resource_type;

struct I2CResource
{
    term transmitting_pid;
    i2c_port_t i2c_num;
    i2c_cmd_handle_t cmd;
    uint32_t send_timeout_ms;
};

static term create_pair(Context *ctx, term term1, term term2)
{
    term ret = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(ret, 0, term1);
    term_put_tuple_element(ret, 1, term2);

    return ret;
}

static term create_error_tuple(Context *ctx, term reason)
{
    return create_pair(ctx, ERROR_ATOM, reason);
}

static bool is_i2c_resource_open(const struct I2CResource *rsrc_obj)
{
    return rsrc_obj->i2c_num != I2C_NUM_MAX;
}

static void reset_i2c_transmission_state(struct I2CResource *rsrc_obj)
{
    if (rsrc_obj->cmd != NULL) {
        i2c_cmd_link_delete(rsrc_obj->cmd);
        rsrc_obj->cmd = NULL;
    }
    rsrc_obj->transmitting_pid = term_invalid_term();
}

static esp_err_t close_i2c_resource(struct I2CResource *rsrc_obj)
{
    if (!is_i2c_resource_open(rsrc_obj)) {
        return ESP_OK;
    }

    esp_err_t err = i2c_driver_delete(rsrc_obj->i2c_num);
    if (err == ESP_OK) {
        rsrc_obj->i2c_num = I2C_NUM_MAX;
        reset_i2c_transmission_state(rsrc_obj);
    }

    return err;
}

static bool is_i2c_resource(GlobalContext *global, term t)
{
    bool ret = term_is_tuple(t)
        && term_get_tuple_arity(t) == 3
        && globalcontext_is_term_equal_to_atom_string(global, term_get_tuple_element(t, 0), I2C_ATOMSTR)
        && term_is_resource_reference(term_get_tuple_element(t, 1))
        && term_is_reference(term_get_tuple_element(t, 2));

    return ret;
}

static bool to_i2c_resource(term i2c_resource, struct I2CResource **rsrc_obj, Context *ctx)
{
    if (!is_i2c_resource(ctx->global, i2c_resource)) {
        return false;
    }
    void *rsrc_obj_ptr;
    if (UNLIKELY(!enif_get_resource(erl_nif_env_from_context(ctx), term_get_tuple_element(i2c_resource, 1), i2c_resource_type, &rsrc_obj_ptr))) {
        return false;
    }
    *rsrc_obj = (struct I2CResource *) rsrc_obj_ptr;

    return true;
}

static bool to_open_i2c_resource(term i2c_resource, struct I2CResource **rsrc_obj, Context *ctx)
{
    if (!to_i2c_resource(i2c_resource, rsrc_obj, ctx)) {
        return false;
    }

    return is_i2c_resource_open(*rsrc_obj);
}

//
// i2c:open_nif/1
//

static term nif_i2c_open(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);
    GlobalContext *global = ctx->global;
    term opts = argv[0];

    //
    // Validate inputs
    //
    term scl = interop_kv_get_value(opts, ATOM_STR("\x3", "scl"), global);
    VALIDATE_VALUE(scl, term_is_integer);

    term sda = interop_kv_get_value(opts, ATOM_STR("\x3", "sda"), global);
    VALIDATE_VALUE(sda, term_is_integer);

    term clock_speed_hz = interop_kv_get_value(opts, ATOM_STR("\xE", "clock_speed_hz"), global);
    VALIDATE_VALUE(clock_speed_hz, term_is_integer);

    i2c_port_t i2c_num = I2C_NUM_0;
    term peripheral = interop_kv_get_value(opts, ATOM_STR("\xA", "peripheral"), global);
    if (!term_is_invalid_term(peripheral)) {
        if (!term_is_integer(peripheral)) {
            ESP_LOGE(TAG, "Invalid parameter: peripheral is not an integer");
            RAISE_ERROR(BADARG_ATOM);
        }
        i2c_num = term_to_int32(peripheral);
        if (i2c_num < 0 || i2c_num > I2C_NUM_MAX - 1) {
            ESP_LOGE(TAG, "Invalid parameter: i2c_num out of range");
            RAISE_ERROR(BADARG_ATOM);
        }
    }

    term send_timeout_ms = interop_kv_get_value_default(opts, ATOM_STR("\xF", "send_timeout_ms"), term_from_int(DEFAULT_SEND_TIMEOUT_MS), global);
    uint32_t send_timeout_ms_val = portMAX_DELAY;
    if (term_is_integer(send_timeout_ms)) {
        if (term_to_int32(send_timeout_ms) < 0) {
            ESP_LOGE(TAG, "Invalid parameter: send_timeout_ms < 0");
            RAISE_ERROR(BADARG_ATOM);
        } else {
            send_timeout_ms_val = term_to_int32(send_timeout_ms);
        }
    } else if (send_timeout_ms != INFINITY_ATOM) {
        ESP_LOGE(TAG, "Invalid parameter: send_timeout_ms send_timeout_ms must be a non-negative integer or `infinity`");
        RAISE_ERROR(BADARG_ATOM);
    }

    //
    // Initialize config
    //

    i2c_config_t conf;
    memset(&conf, 0, sizeof(i2c_config_t));
    conf.mode = I2C_MODE_MASTER;
    conf.scl_io_num = term_to_int32(scl);
    conf.sda_io_num = term_to_int32(sda);
    conf.sda_pullup_en = GPIO_PULLUP_ENABLE;
    conf.scl_pullup_en = GPIO_PULLUP_ENABLE;
    conf.master.clk_speed = term_to_int32(clock_speed_hz);

    esp_err_t err;
    err = i2c_param_config(i2c_num, &conf);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "Failed to initialize I2C parameters.  err=%i", err);
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        // TODO breaks i2c::open/1 API
        return create_error_tuple(ctx, term_from_int(err));
    }

    //
    // Install the I2C driver
    //

    err = i2c_driver_install(i2c_num, I2C_MODE_MASTER, 0, 0, 0);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "Failed to install I2C driver.  err=%i", err);
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        // TODO breaks i2c::open/1 API
        return create_error_tuple(ctx, term_from_int(err));
    }

    ESP_LOGI(TAG, "I2C driver installed using I2C port %i", i2c_num);

    //
    // allocate and initialize the Nif resource
    //

    struct I2CResource *rsrc_obj = enif_alloc_resource(i2c_resource_type, sizeof(struct I2CResource));
    if (IS_NULL_PTR(rsrc_obj)) {
        i2c_driver_delete(i2c_num);
        ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }
    rsrc_obj->transmitting_pid = term_invalid_term();
    rsrc_obj->i2c_num = i2c_num;
    rsrc_obj->cmd = NULL;
    rsrc_obj->send_timeout_ms = send_timeout_ms_val;

