atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/i2c_resource.c
    if (UNLIKELY(memory_ensure_free(ctx, TERM_BOXED_RESOURCE_SIZE) != MEMORY_GC_OK)) {
        close_i2c_resource(rsrc_obj);
        enif_release_resource(rsrc_obj);
        ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.", __FILE__, __LINE__);
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }
    term obj = term_from_resource(rsrc_obj, &ctx->heap);
    enif_release_resource(rsrc_obj);

    //
    // Return result
    //

    // {'$i2c', Resource :: resource(), Ref :: reference()} :: i2c()
    size_t requested_size = TUPLE_SIZE(3) + REF_SIZE;
    if (UNLIKELY(memory_ensure_free_with_roots(ctx, requested_size, 1, &obj, MEMORY_CAN_SHRINK) != MEMORY_GC_OK)) {
        close_i2c_resource(rsrc_obj);
        ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.", __FILE__, __LINE__);
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }

    term i2c = term_alloc_tuple(3, &ctx->heap);
    term_put_tuple_element(i2c, 0, globalcontext_make_atom(global, I2C_ATOMSTR));
    term_put_tuple_element(i2c, 1, obj);
    uint64_t ref_ticks = globalcontext_get_ref_ticks(ctx->global);
    term ref = term_from_ref_ticks(ref_ticks, &ctx->heap);
    term_put_tuple_element(i2c, 2, ref);

    return i2c;
}

//
// i2c:close_nif/1
//

static term nif_i2c_close(Context *ctx, int argc, term argv[])
{
    TRACE("nif_close\n");
    UNUSED(argc);
    GlobalContext *global = ctx->global;

    //
    // extract the resource
    //
    term i2c_resource = argv[0];
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!to_open_i2c_resource(i2c_resource, &rsrc_obj, ctx))) {
        ESP_LOGE(TAG, "Failed to convert i2c_resource");
        RAISE_ERROR(BADARG_ATOM);
    }

    //
    // reject close if another process has an active transmission
    //
    if (UNLIKELY(!term_is_invalid_term(rsrc_obj->transmitting_pid))) {
        ESP_LOGE(TAG, "nif_close: A process is in the process of transmitting.");

        // {error, {einprogress, Pid :: pid()}}
        if (UNLIKELY(memory_ensure_free(ctx, 2 * TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        term reason = create_pair(
            ctx,
            globalcontext_make_atom(global, EINPROGRESS_ATOMSTR),
            rsrc_obj->transmitting_pid
        );
        return create_error_tuple(ctx, reason);
    }

    esp_err_t err;

    err = close_i2c_resource(rsrc_obj);
    CHECK_ERROR(ctx, err, "nif_close; Failed to delete driver");

    return OK_ATOM;
}

//
// i2c:write_bytes_nif/2
//

static term nif_i2c_write_bytes(Context *ctx, int argc, term argv[])
{
    TRACE("nif_write_bytes\n");
    UNUSED(argc);
    GlobalContext *global = ctx->global;

    //
    // extract the resource
    //
    term i2c_resource = argv[0];
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!to_open_i2c_resource(i2c_resource, &rsrc_obj, ctx))) {
        ESP_LOGE(TAG, "Failed to convert i2c_resource");
        RAISE_ERROR(BADARG_ATOM);
    }

    //
    // ensure there is not a currently running transmission
    //
    if (UNLIKELY(!term_is_invalid_term(rsrc_obj->transmitting_pid))) {
        ESP_LOGE(TAG, "nif_write_bytes: Another process is in the process of transmitting.");

        // {error, {einprogress, Pid :: pid()}}
        if (UNLIKELY(memory_ensure_free(ctx, 2 * TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        term reason = create_pair(
            ctx,
            globalcontext_make_atom(global, EINPROGRESS_ATOMSTR),
            rsrc_obj->transmitting_pid
        );
        return create_error_tuple(ctx, reason);
    }

    //
    // extract the arguments
    //
    term req = argv[1];
    int arity = term_get_tuple_arity(req);

    term address = term_get_tuple_element(req, 0);
    uint8_t addr = term_to_int32(address);

    term data = term_get_tuple_element(req, 1);
    uint8_t datum;
    uint8_t *buf;
    size_t data_len;
    if (term_is_binary(data)) {
        buf = (uint8_t *) term_binary_data(data);
        data_len = term_binary_size(data);
    } else if (term_is_integer(data)) {
        datum = term_to_int32(data);
        buf = &datum;
        data_len = 1;
    } else {
        ESP_LOGE(TAG, "Data is nether a binary nor an integer");
        RAISE_ERROR(BADARG_ATOM);
    }

    term register_ = term_invalid_term();
    uint8_t register_address;
    if (arity == 3) {
        register_ = term_get_tuple_element(req, 2);
        register_address = term_to_int32(register_);
    }

    //
    // Enqueue and run the I2C commands
    //

    esp_err_t err;
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();

    err = i2c_master_start(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_write_bytes; enqueue start bit: err: %i.", err);
        goto cleanup_write;
    }

    err = i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_WRITE, ACK_ENABLE);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_write_bytes; enqueue I2C bus address: err: %i.", err);
        goto cleanup_write;
    }

    if (!term_is_invalid_term(register_)) {
        err = i2c_master_write_byte(cmd, register_address, ACK_ENABLE);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "nif_write_bytes; enqueue register address: err: %i.", err);
            goto cleanup_write;
        }
    }

    err = i2c_master_write(cmd, buf, data_len, ACK_ENABLE);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_write_bytes; enqueue write data: err: %i.", err);
        goto cleanup_write;
    }

    err = i2c_master_stop(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_write_bytes; enqueue stop bit: err: %i.", err);
        goto cleanup_write;
    }

    err = i2c_master_cmd_begin(rsrc_obj->i2c_num, cmd, MS_TO_TICKS(rsrc_obj->send_timeout_ms));

cleanup_write:
    i2c_cmd_link_delete(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            return OUT_OF_MEMORY_ATOM;
        }
        return create_error_tuple(ctx, esp_err_to_term(ctx->global, err));
    }

    //
    // return result
    //

    return OK_ATOM;
}

//
// i2c:read_bytes_nif/2
//

static term nif_i2c_read_bytes(Context *ctx, int argc, term argv[])
{
    TRACE("nif_read_bytes\n");
    UNUSED(argc);
    GlobalContext *global = ctx->global;

    //
    // extract the resource
    //
    term i2c_resource = argv[0];
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!to_open_i2c_resource(i2c_resource, &rsrc_obj, ctx))) {
        ESP_LOGE(TAG, "Failed to convert i2c_resource");
        RAISE_ERROR(BADARG_ATOM);
    }

    //
    // ensure there is not a currently running transmission
    //
    if (UNLIKELY(!term_is_invalid_term(rsrc_obj->transmitting_pid))) {
        ESP_LOGE(TAG, "nif_read_bytes: Another process is already transmitting");

        // {error, {einprogress, Pid :: pid()}}
        if (UNLIKELY(memory_ensure_free(ctx, 2 * TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        term reason = create_pair(
            ctx,
            globalcontext_make_atom(global, EINPROGRESS_ATOMSTR),
            rsrc_obj->transmitting_pid
        );
        return create_error_tuple(ctx, reason);
    }

    //
    // extract the arguments
    //
    term req = argv[1];
    int arity = term_get_tuple_arity(req);

    term address = term_get_tuple_element(req, 0);
    uint8_t addr = term_to_int32(address);

    term read_bytes = term_get_tuple_element(req, 1);
    avm_int_t read_count = term_to_int32(read_bytes);

    term register_ = term_invalid_term();
    uint8_t register_address = 0;
    if (arity == 3) {
        register_ = term_get_tuple_element(req, 2);
        register_address = term_to_int32(register_);
    }

    //
    // initialize the output buffer
    //

