atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/i2c_resource.c
    // {ok, Data :: binary()}
    if (UNLIKELY(memory_ensure_free_opt(ctx, TUPLE_SIZE(2) + term_binary_heap_size(read_count), MEMORY_NO_GC) != MEMORY_GC_OK)) {
        ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
        return OUT_OF_MEMORY_ATOM;
    }
    term data = term_create_uninitialized_binary(read_count, &ctx->heap, ctx->global);
    uint8_t *buf = (uint8_t *) term_binary_data(data);

    //
    // Enqueue and run the I2C commands
    //

    esp_err_t err;
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();

    err = i2c_master_start(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_read_bytes; enqueue start bit: err: %i.", err);
        goto cleanup_read;
    }

    if (!term_is_invalid_term(register_)) {
        err = i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_WRITE, ACK_ENABLE);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "nif_read_bytes; enqueue write address: err: %i.", err);
            goto cleanup_read;
        }
        err = i2c_master_write_byte(cmd, register_address, ACK_ENABLE);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "nif_read_bytes; enqueue register address: err: %i.", err);
            goto cleanup_read;
        }
        err = i2c_master_start(cmd);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "nif_read_bytes; enqueue repeated start: err: %i.", err);
            goto cleanup_read;
        }
    }

    err = i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_READ, ACK_ENABLE);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_read_bytes; enqueue I2C bus address: err: %i.", err);
        goto cleanup_read;
    }

    err = i2c_master_read(cmd, buf, read_count, I2C_MASTER_LAST_NACK);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_read_bytes; enqueue read data: err: %i.", err);
        goto cleanup_read;
    }

    err = i2c_master_stop(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_read_bytes; enqueue stop bit: err: %i.", err);
        goto cleanup_read;
    }

    err = i2c_master_cmd_begin(rsrc_obj->i2c_num, cmd, MS_TO_TICKS(rsrc_obj->send_timeout_ms));

cleanup_read:
    i2c_cmd_link_delete(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            return OUT_OF_MEMORY_ATOM;
        }
        return create_error_tuple(ctx, esp_err_to_term(ctx->global, err));
    }

    //
    // return result
    //

    // NB. memory has already been allocated above for {ok, Data} tuple
    return create_pair(ctx, OK_ATOM, data);
}

//
// i2c:begin_transmission_nif/1
//

static term nif_i2c_begin_transmission(Context *ctx, int argc, term argv[])
{
    TRACE("nif_begin_transmission\n");
    UNUSED(argc);
    GlobalContext *global = ctx->global;

    //
    // extract the resource
    //
    term i2c_resource = argv[0];
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!to_open_i2c_resource(i2c_resource, &rsrc_obj, ctx))) {
        ESP_LOGE(TAG, "Failed to convert i2c_resource");
        RAISE_ERROR(BADARG_ATOM);
    }

    //
    // ensure there is not a currently running transmission
    //
    if (UNLIKELY(!term_is_invalid_term(rsrc_obj->transmitting_pid))) {
        ESP_LOGE(TAG, "nif_begin_transmission: Another process is in the process of transmitting.");

        // {error, {einprogress, Pid :: pid()}}
        if (UNLIKELY(memory_ensure_free(ctx, 2 * TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        term reason = create_pair(
            ctx,
            globalcontext_make_atom(global, EINPROGRESS_ATOMSTR),
            rsrc_obj->transmitting_pid
        );
        return create_error_tuple(ctx, reason);
    }

    //
    // extract the arguments
    //

    term address = argv[1];
    uint8_t addr = term_to_int32(address);

    //
    // Initiate the I2C command
    //

    esp_err_t err;
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();

    err = i2c_master_start(cmd);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_begin_transmission; enqueue start bit: err: %i.", err);
        goto cleanup_begin;
    }

    err = i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_WRITE, ACK_ENABLE);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_begin_transmission; enqueue I2C bus address: err: %i.", err);
        goto cleanup_begin;
    }

    rsrc_obj->transmitting_pid = term_from_local_process_id(ctx->process_id);
    rsrc_obj->cmd = cmd;

    return OK_ATOM;

cleanup_begin:
    i2c_cmd_link_delete(cmd);
    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
        return OUT_OF_MEMORY_ATOM;
    }
    return create_error_tuple(ctx, esp_err_to_term(ctx->global, err));
}

//
// i2c:enqueue_write_bytes_nif/1
//

static term nif_i2c_enqueue_write_bytes(Context *ctx, int argc, term argv[])
{
    TRACE("nif_enqueue_write_bytes\n");
    UNUSED(argc);
    GlobalContext *global = ctx->global;

    //
    // extract the resource
    //
    term i2c_resource = argv[0];
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!to_open_i2c_resource(i2c_resource, &rsrc_obj, ctx))) {
        ESP_LOGE(TAG, "Failed to convert i2c_resource");
        RAISE_ERROR(BADARG_ATOM);
    }

    //
    // ensure there the currently running transmission is the current process
    //
    term pid = term_from_local_process_id(ctx->process_id);
    if (UNLIKELY(rsrc_obj->transmitting_pid != pid)) {
        ESP_LOGE(TAG, "nif_end_transmission: Another process is in the process of transmitting.");

        // {error, {einprogress, Pid :: pid()}}
        if (UNLIKELY(memory_ensure_free(ctx, 2 * TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        term reason = create_pair(
            ctx,
            globalcontext_make_atom(global, EINPROGRESS_ATOMSTR),
            rsrc_obj->transmitting_pid
        );
        return create_error_tuple(ctx, reason);
    }

    term data = argv[1];
    const uint8_t *buf = (const uint8_t *) term_binary_data(data);
    size_t len = term_binary_size(data);

    esp_err_t err;
    for (size_t i = 0; i < len; ++i) {
        err = i2c_master_write_byte(rsrc_obj->cmd, buf[i], ACK_ENABLE);
        if (UNLIKELY(err != ESP_OK)) {
            ESP_LOGE(TAG, "nif_enqueue_write_bytes; enqueue i2c_master_write_byte: err: %i.", err);
            reset_i2c_transmission_state(rsrc_obj);
            if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
                return OUT_OF_MEMORY_ATOM;
            }
            return create_error_tuple(ctx, esp_err_to_term(ctx->global, err));
        }
    }

    return OK_ATOM;
}

//
// i2c:end_transmission_nif/1
//

static term nif_i2c_end_transmission(Context *ctx, int argc, term argv[])
{
    TRACE("nif_end_transmission\n");
    UNUSED(argc);
    GlobalContext *global = ctx->global;

    //
    // extract the resource
    //
    term i2c_resource = argv[0];
    struct I2CResource *rsrc_obj;
    if (UNLIKELY(!to_open_i2c_resource(i2c_resource, &rsrc_obj, ctx))) {
        ESP_LOGE(TAG, "Failed to convert i2c_resource");
        RAISE_ERROR(BADARG_ATOM);
    }

    //
    // ensure there the currently running transmission is the current process
    //
    term pid = term_from_local_process_id(ctx->process_id);
    if (UNLIKELY(rsrc_obj->transmitting_pid != pid)) {
        ESP_LOGE(TAG, "nif_end_transmission: Another process is in the process of transmitting.");

        // {error, {einprogress, Pid :: pid()}}
        if (UNLIKELY(memory_ensure_free(ctx, 2 * TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            ESP_LOGW(TAG, "Failed to allocate memory: %s:%i.\n", __FILE__, __LINE__);
            return OUT_OF_MEMORY_ATOM;
        }
        term reason = create_pair(
            ctx,
            globalcontext_make_atom(global, EINPROGRESS_ATOMSTR),
            rsrc_obj->transmitting_pid
        );
        return create_error_tuple(ctx, reason);
    }

    //
    // Write the stop bit and flush the I2C command(s) that have been written
    //

    esp_err_t err;
    err = i2c_master_stop(rsrc_obj->cmd);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGE(TAG, "nif_end_transmission; enqueue stop bit: err: %i.", err);
        goto cleanup_end;
    }

    err = i2c_master_cmd_begin(rsrc_obj->i2c_num, rsrc_obj->cmd, MS_TO_TICKS(rsrc_obj->send_timeout_ms));

cleanup_end:
    i2c_cmd_link_delete(rsrc_obj->cmd);
    rsrc_obj->cmd = NULL;
    rsrc_obj->transmitting_pid = term_invalid_term();
    if (UNLIKELY(err != ESP_OK)) {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            return OUT_OF_MEMORY_ATOM;
        }
        return create_error_tuple(ctx, esp_err_to_term(ctx->global, err));
    }

    return OK_ATOM;
}

//
// entrypoints
//

static void i2c_resource_dtor(ErlNifEnv *caller_env, void *obj)
{
    UNUSED(caller_env);
    struct I2CResource *rsrc_obj = (struct I2CResource *) obj;

    esp_err_t err = close_i2c_resource(rsrc_obj);
    if (UNLIKELY(err != ESP_OK)) {
        ESP_LOGW(TAG, "Failed to delete driver in resource d'tor.  err=%i", err);
    }
}

static const ErlNifResourceTypeInit I2CResourceTypeInit = {
    .members = 1,
    .dtor = i2c_resource_dtor,
};

